max-bot-cf/InformationRegisters/энргНомераПломбСостояниеПозиций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНомераПломбСостояниеПозиций</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМестаУстановкиПломб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/InformationRegisters/энргНомераПломбСостояниеПозиций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет действующие номера позиции пломб.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДействующиеНомераПозицииПломб(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "ДействующиеНомераПозицииПломб") Экспорт
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргНомераПломбНаличиеПломб.ОпломбированныеПриборыУчета(Схема, ПараметрыОтбора, "ОпломбированныеПриборыУчета");
	Иначе
		ЕстьОпломбированныеПриборыУчета		= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ОпломбированныеПриборыУчета" Тогда
				ЕстьОпломбированныеПриборыУчета = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьОпломбированныеПриборыУчета Тогда
			РегистрыСведений.энргНомераПломбНаличиеПломб.ОпломбированныеПриборыУчета(Схема, ПараметрыОтбора, "ОпломбированныеПриборыУчета");
		КонецЕсли;
	КонецЕсли;
		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующиеНомераПозицииПломб());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;	
	ПараметрПериод 						= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Отбор 							= ОператорВыбора.Отбор;		
		ДоступныеПараметры 				= "Организация, Район, КлючПомещения, ПриборУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДействующиеНомераПозицииПломб()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргНомераПломбСостояниеПозицийСрезПоследних.Организация КАК Организация,
	|	энргНомераПломбСостояниеПозицийСрезПоследних.Район КАК Район,
	|	энргНомераПломбСостояниеПозицийСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргНомераПломбСостояниеПозицийСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргНомераПломбСостояниеПозицийСрезПоследних.МестоУстановки КАК МестоУстановки
	|ИЗ
	|	РегистрСведений.энргНомераПломбСостояниеПозиций.СрезПоследних(
	|			,
	|			(Организация, Район, КлючПомещения, ПриборУчета) В
	|				(ВЫБРАТЬ
	|					ОпломбированныеПриборыУчета.Организация,
	|					ОпломбированныеПриборыУчета.Район,
	|					ОпломбированныеПриборыУчета.КлючПомещения,
	|					ОпломбированныеПриборыУчета.ПриборУчета
	|				ИЗ
	|					ОпломбированныеПриборыУчета КАК ОпломбированныеПриборыУчета)) КАК энргНомераПломбСостояниеПозицийСрезПоследних
	|ГДЕ
	|	энргНомераПломбСостояниеПозицийСрезПоследних.Состояние";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецЕсли
